CORRECT_CONTRAGENT_NAMES: dict[str, str] = {
    # mekpa group (connect)
    "meklas grouo (connect)": "mekpa group (connect)",
    "mekpa otomotiv ith. ihr. san. tic. ltd.": "mekpa group (connect)",

    # гуменюк николай вячеславович ип (джоникс)
    "джоинфлекс ооо": "гуменюк николай вячеславович ип (джоникс)",
    "джоникс ооо": "гуменюк николай вячеславович ип (джоникс)",

    # озбэттериз ооо
    "белинвестторг ооо": "озбэттериз ооо",

    # саф-холланд руссланд ооо
    "саф-холланд рус ооо": "саф-холланд руссланд ооо",
    "сафхолланд рус ооо": "саф-холланд руссланд ооо",

    # мале рус ооо
    "mahle": "мале рус ооо"
}

FALSE_CONTRAGENT_SUBSTRINGS: set = {
    "+",
    '"',
    "(эдо)",
    "(поставщик покупатель)",
    "(поставщик, покупатель)",
    "(поставщик/покупатель)",
    "(поставщик и покупатель)",
    "(дата пр. деятельности: 28.11.22)",
    "инн 7802390911"
}
