CORRECT_SHOP_NAMES: dict[str, str] = {
    # Склады
    "_центральный склад": "_склад центральный",

    # Магазины
    "магазин (нсб) коченево": "_склад новосибирск",
    "магазин омск": "магазин омск 2",
    "магазин тольятти": "магазин тольятти 2",
    "магазин шушары": "магазин шушары 2",

    # Товары в пути
    "товары в пути елабуга": "_склад елабуга",
    "товары в пути склад (европа) красный бор": "_склад (европа) красный бор",
    "товары в пути екатеринбург 2": "магазин екатеринбург 2",
    "товары в пути нижний новгород": "магазин нижний новгород 1",
    "товары в пути омск 2": "магазин омск 2",
    "товары в пути центральный склад верхняя 16-с-кмз(": "_склад центральный (верхняя 16-с-кмз)",
    "товары в пути центральный": "_склад центральный",
    "товары в пути тольятти 2": "магазин тольятти 2",
    "товары в пути саратов-еремеевка": "магазин саратов-еремеевка",
    "товары в пути москва ленинградка": "магазин москва ленинградка",
    "товары в пути _сотранс сити": "_склад центральный",
    "товары в пути шушары": "магазин шушары 2",
    "товары в пути  склад  ттс": "_склад ттс",
    "товары в пути омск": "магазин омск 2",
    "товары в пути  (нсб) малыгина": "_склад новосибирск",
    "товары в пути екатеринбург": "магазин екатеринбург 1",
    "товары в пути  склад парнас 2, верхняя 16": "_склад центральный (верхняя 16-с-кмз)",
    "товары в пути (нсб) коченево": "_склад новосибирск",
    "товары в пути ростов-на-дону": "магазин ростов-на-дону",
    "товары в пути санкт-петербург": "магазин санкт-петербург",
    "товары в пути парнас": "магазин парнас",
    "товары в пути тольятти": "магазин тольятти 2",
    "товары в пути челябинск": "магазин челябинск",
    "товары в пути иркутск": "магазин иркутск",
    "товары в пути псков": "магазин псков",
    "товары в пути уфа": "магазин уфа",
    "товары в пути великий новгород": "магазин великий новгород",
    "товары в пути склад новосибирск": "_склад новосибирск",
    "товары в пути петрозаводск": "магазин петрозаводск",
    "товары в пути нижний новгород 2": "магазин нижний новгород 2",
    "товары в пути архангельск": "магазин архангельск",
    "товары в пути шушары 2": "магазин шушары 2",
    "товары в пути красноярск": "магазин красноярск",
    "товары в пути воронеж": "магазин воронеж",
    "товары в пути москва": "магазин москва ельня"

}

TRUE_SHOP_NAMES: set = {
    # Склады
    "_склад новосибирск",
    "_склад центральный",

    # Магазины
    "магазин архангельск",
    "магазин великий новгород",
    "магазин воронеж",
    "магазин екатеринбург 1",
    "магазин екатеринбург 2",
    "магазин иркутск",
    "магазин красноярск",
    "магазин москва ельня",
    "магазин москва ленинградка",
    "магазин мурманск",
    "магазин нижний новгород 1",
    "магазин нижний новгород 2",
    "магазин новосибирск",
    "магазин омск",
    "магазин омск 2",
    "магазин парнас",
    "магазин петрозаводск",
    "магазин псков",
    "магазин ростов-на-дону",
    "магазин тольятти 2",
    "магазин уфа",
    "магазин челябинск",
    "магазин шушары 2"
}

FALSE_SHOP_NAMES: set = {
    "_склад №1",
    "_склад санкт-петербург",
    "_склад спб-транс",
    "_склад  ттс",
    "магазин саратов-еремеевка",
    "оптовый склад европа",
    "оптовый склад америка",
    "отгрузка остатков тц (красный бор)",
    "питербасцентр комиссия",
    "склад магазин (европа)",
    "склад парнас (пбц)",
    "центральный склад (европа)",
    "склад юнайтедсервис шушары",
    "_елабуга",
    "запчасти для китайской техники",
    "склад мз транзит",
    "склад механический завод",
    "бу_центральный склад"
}
